In [1]:
import pandas as pd
import numpy as np

In [4]:
sr= {"s": pd.Series([1,2,3,4]), "r" : pd.Series([1,2,3,4])}
var3=pd.DataFrame(sr)
print (var3)

   s  r
0  1  1
1  2  2
2  3  3
3  4  4

In [11]:
# Arithmetic Operations
var1=pd.DataFrame({"A": [1,2,3,4], "B": [5,6,7,8]})
var1

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [12]:
var1["C"]=var1["A"]+var1["B"]
var1

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [13]:
var1["C"]=var1["A"]*var1["B"]
var1

   A  B   C
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [16]:
var1["Panda"]=var1["A"]<=3
var1

   A  B   C  Panda
0  1  5   5   True
1  2  6  12   True
2  3  7  21   True
3  4  8  32  False